//! @file	controller.h
//! @author	北出真弓
//! @date	2019-01-07
//! @brief	コントローラーの設定の定義

#pragma once

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

/**************************************************************************//**
	@enum		COMAND
	@brief		コマンド入力のenum
	@par		COMAND型の定義
*//***************************************************************************/
enum COMAND
{
	STARTBUTTON,		//!< スタートボタン
	ATTACK,				//!< 攻撃
	RIGHTMOVE,			//!< 右移動
	LEFTMOVE,			//!< 左移動
	UPMOVE,				//!< 上移動
	DOWNMOVE,			//!< 下移動
	COMANDMAX			//!< コマンド最大数
};

/**************************************************************************//**
	@brief		入力コマンド処理
	@param[in]	nCommand	入力コマンド
	@return		true		入力処理成功
				false		入力処理失敗
*//***************************************************************************/
bool GetInput(int nCommand);