//=============================================================================
//
// マップファイル処理 [file.h]
// Author : kitade mayumi
//
//=============================================================================

/**************************************************************************//**
	@brief		OpenFile
	@brief		ファイルを開く処理
	@param		なし
	@return		E_FAIL	失敗
				S_OK	成功
*//***************************************************************************/
HRESULT OpenFile(void);

/**************************************************************************//**
	@brief		OpenBonusFile
	@brief		ボーナスファイルを開く処理
	@param		なし
	@return		E_FAIL	失敗
				S_OK	成功
*//***************************************************************************/
HRESULT OpenBonusFile(void);

/**************************************************************************//**
	@brief		OpenTutrialFile
	@brief		チュートリアルファイルを開く処理
	@param		なし
	@return		E_FAIL	失敗
				S_OK	成功
*//***************************************************************************/
HRESULT OpenTutrialFile(void);

/**************************************************************************//**
	@brief		GetFileData
	@param		なし		
	@return		&datas[0][0][0]		マップファイルデータの先頭ポインタ
*//***************************************************************************/
int *GetFileData(void);

/**************************************************************************//**
	@brief		GetBonusFileData
	@param		なし
	@return		&bonusData[0][0][0]	マップファイルデータの先頭ポインタ
*//***************************************************************************/
int *GetBonusFileData(void);

/**************************************************************************//**
	@brief		GetTutrialFileData
	@param		なし
	@return		&tutrialData[0][0][0]	マップファイルデータの先頭ポインタ
*//***************************************************************************/
int *GetTutrialFileData(void);
