//! @file	wall.h
//! @author	kitade mayumi
//! @date	2020-08-07
//! @brief	壁の定義

#ifndef _WALL_H_
#define _WALL_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define WALL_TEXTURE_SIZEX	(SCREEN_WIDTH)
#define WALL_TEXTURE_SIZEY	(SCREEN_HEIGHT)


struct WALL
{
	D3DXVECTOR3			pos;					// 位置
	bool				use;					// 使用されているかどうか
	float				speed;					// 移動スピード
	LPDIRECT3DTEXTURE9	Texture;				// テクスチャ情報
	VERTEX_2D			vertexWk[NUM_VERTEX];	// 頂点情報格納ワーク

};

/**************************************************************************//**
	@brief		InitWall
	@brief		壁の初期化処理
	@param		なし
	@return			S_OK	処理の成功
					E-FAIL	処理の失敗
*//***************************************************************************/
HRESULT InitWall(void);

/**************************************************************************//**
	@brief		UninitWall
	@brief		壁の終了処理
	@param		なし
	@return		なし
*//***************************************************************************/
void UninitWall(void);

/**************************************************************************//**
	@brief		UpdateWall
	@brief		壁の更新処理
	@param		なし
	@return		なし
*//***************************************************************************/
void UpdateWall(void);

/**************************************************************************//**
	@brief		DrawWall
	@brief		壁の描画処理
	@param		なし
	@return		なし
*//***************************************************************************/
void DrawWall(void);

/**************************************************************************//**
	@brief		GetWall
	@brief		壁の描画処理
	@param		なし
	@return		g_wall
*//***************************************************************************/
WALL *GetWall(void);

#endif
